<template>
    <view>



        <view class="d-flex">
            <u-picker :columns="citys" :show="show0" close-on-click-overlay @cancel="cancel0" @close="close0"
                      @confirm="confirm0"></u-picker>
            <u-button class="w-50" @click="btn0">
                <span v-if="!show1" class="" style="margin: auto;color: #18b566">位置</span>
                <span v-if="show1" class="" style="margin: auto;color: #18b566">{{ city }}</span>
                <!-- <u-icon name="arrow-down"></u-icon> -->
            </u-button>

            <u-picker :columns="departments" :show="show2" close-on-click-overlay @cancel="cancel1" @close="close1"
                      @confirm="confirm1"></u-picker>
            <u-button class="d-flex" @click="btn1">
                <span v-if="!show3" class="" style="margin: auto;color: #18b566">科室</span>
                <span v-if="show3" class="" style="margin: auto;color: #18b566">{{ department }}</span>
                <!-- <u-icon name="arrow-down"></u-icon> -->
            </u-button>
				
        </view>
    </view>
</template>

<script>
import {wisperImage} from "../../../static/js/homePage/staticData";
import UPicker from "../../../uni_modules/uview-ui/components/u-picker/u-picker.vue";

export default {
    name: "advisory",
    components: {UPicker},

    data() {
        return {
            city: '',
            citys: [
                ["东城", "西城", "崇文", "宣武", "朝阳", "丰台", "石景山", "海淀", "门头沟", "房山", "通州", "顺义", "昌平", "大兴",
                    "平谷", "怀柔", "密云", "延庆",

                    "黄浦", "卢湾", "徐汇", "长宁", "静安", "普", "闸北", "虹口", "杨浦", "闵行", "宝山", "嘉定", "浦东", "金山",
                    "松江", "青浦", "南汇", "奉贤", "崇明",

                    "和平", "东丽", "河东", "西青", "河西", "南", "南开", "北辰", "河北", "武清", "红挢", "塘沽", "汉沽", "大港",
                    "宁河", "静海", "宝坻", "蓟县",

                    "万州", "涪陵", "渝中", "大渡口", "江北", "沙坪", "九龙坡", "南岸", "北碚", "万盛", "双挢", "渝北", "巴南", "黔江",
                    "长寿", "綦江", "潼南", "铜梁 ", "大足", "荣昌", "壁山", "梁平", "城口", "丰都", "垫江", "武隆", "忠县", "开县",
                    "云", "奉节", "巫山", "巫溪", "石柱", "秀山", "酉阳", "彭水", "江津", "合川", "永川", "南川",

                    "石家庄", "邯郸", "邢台", "保定", "张家口", "承德", "廊坊", "唐山", "秦皇岛", "沧州", "衡水",
                    "太原", "大同", "阳泉", "长治", "晋城", "朔州", "吕梁", "忻州", "晋中", "临汾", "运城",
                    "呼和浩特", "包头", "乌海", "赤峰", "呼伦贝尔盟", "阿拉善盟", "哲里木盟", "兴安盟", "乌兰布盟", "锡林郭勒盟", "巴彦淖尔盟",
                    "伊克昭盟",

                    "沈阳", "大连", "鞍山", "抚顺", "本溪", "东", "锦州", "营口", "阜新", "辽阳", "盘锦", "铁岭", "朝阳", "葫芦岛",
                    "长春", "吉林", "四平", "辽源", "通化", "白山", "松原", "白城", "延边",
                    "哈尔滨", "齐齐哈尔", "牡丹江", "佳木斯", "大庆", "绥化", "鹤岗", "鸡西", "黑河", "双鸭山", "伊春", "七台河", "大安岭",
                    "南京", "镇江", "苏州", "南通", "扬州", "盐城", "徐州", "连云", "常州", "无锡", "宿迁", "泰州", "淮安",
                    "杭州", "宁波", "温州", "嘉兴", "湖州", "绍兴", "金华", "衢州", "舟山", "台州", "丽",
                    "合肥", "芜湖", "蚌埠", "马鞍山", "淮北", "铜陵", "安庆", "黄山", "滁州", "宿州", "池州", "淮南", "巢", "阜阳",
                    "六安", "宣城", "亳州",

                    "福州", "厦门", "莆田", "三明", "泉州", "漳州", "南", "龙岩", "宁德",
                    "南昌市", "景德镇", "九江", "鹰潭", "萍乡", "新馀", "赣州", "吉安", "宜春", "抚州", "上饶",
                    "济南", "青岛", "淄博", "枣庄", "东营", "烟台", "潍坊", "济宁", "泰安", "威海", "日照", "莱芜", "沂", "德州",
                    "聊城", "滨州", "菏泽",

                    "郑州", "开封", "洛阳", "平顶山", "安阳", "鹤壁", "新", "焦作", "濮阳", "许昌", "漯河", "三门峡", "南阳", "商丘",
                    "信阳", "周口", "驻马店", "济源",

                    "武汉", "宜昌", "荆州", "襄樊", "黄石荆门", "黄冈", "十堰", "恩施", "潜江", "天门", "仙桃", "随州", "咸宁", "孝感",
                    "鄂州",

                    "长沙", "常德", "株洲", "湘潭", "衡阳", "岳阳", "邵阳", "益阳娄底", "怀化", "郴州", "永州", "湘西", "张家界",
                    "广州", "深圳", "珠海", "汕头", "东莞", "中山", "佛山", "韶关", "江门", "湛", "茂名", "肇庆", "惠州", "梅州",
                    "汕尾", "河源", "阳江", "清远", "潮州", "揭阳", "云浮",

                    "南宁", "柳", "桂林", "梧州", "北海", "防城港", "钦州", "贵港", "玉林", "南宁地区", "柳州地区", "贺州", "百色",
                    "河池",
                    "海口", "三亚",
                    "都", "绵阳", "德阳", "自贡", "攀枝花", "广元", "内江", "乐山", "南充", "宜宾", "广安", "达川", "雅安", "眉山",
                    "甘孜", "凉山", "泸州",

                    "贵阳", "六盘水", "遵义", "安顺", "铜仁", "黔西南毕节", "黔东南", "黔南",
                    "昆明", "大理", "曲靖", "玉溪", "昭通", "楚雄", "红河", "文山", "思茅", "西双版纳", "保山", "德宏", "丽江", "江",
                    "迪庆", "临沧",

                    "拉萨", "日喀则", "山南", "林芝", "昌都", "阿里", "曲",
                    "西安", "宝鸡", "咸阳", "铜川", "渭南", "延安", "榆林", "汉中", "安康", "商洛",
                    "兰", "嘉峪关", "金昌", "白银", "天水", "酒泉", "张掖", "武威", "定西", "陇南", "平凉", "庆阳", "临夏", "甘",
                    "银川", "石嘴山", "吴忠", "固原",
                    "西宁", "海东", "海南", "海北", "黄南", "玉树", "果洛", "海西",
                    "乌鲁木齐", "石河子", "克玛依", "伊犁", "巴音郭勒", "昌吉", "克孜勒苏柯尔克孜", "博尔塔拉", "吐鲁", "哈密", "喀什", "和田",
                    "阿克苏",

                    "香港特别行政区",
                    "澳门特别行政区",
                    "台北", "高雄", "台中", "台南", "屏东", "南投", "云林", "新竹", "彰化", "苗栗", "嘉义", "莲", "桃园", "宜兰",
                    "基隆", "台东", "金门", "马祖", "澎湖"]
            ],
            local: '',
            departments: [
                [
                    '全科', '内科', '心内科', '呼吸科', '血液科', '消化科', '内分泌科', '风湿免疫科', '血液科外科', '普外科', '骨科', '心外科', '泌尿科', '妇科', '产科', '中医科', '儿科', '五官科',
                    '皮肤科', '神经科', '肿瘤科', '康复科', '老年病科', '急诊科', '麻醉科', '重症医学科', '检验科', '医学影像科', '病理科', '药学部', '输血科', '核医学科', '营养科', '按摩推拿科', '康复科', '理疗科',
                    '心理咨询科', '护士科'
                ]
            ],
            department: '',
            wisperImage,
            show0: false,
            show1: false,
            show2: false,
            show3: false,
        };

    },
    props: {
        tabList: Array
    },
    methods: {
        btn0() {
            this.show0 = true
        },
        btn1() {
            this.show2 = true
        },
        close0() {
            this.show0 = false
        },
        cancel0() {
            this.show0 = false
        },
        close1() {
            this.show2 = false
        },
        cancel1() {
            this.show2 = false
        },
        confirm0(e) {
            this.city = e.value[0]
            this.show1 = true
            this.show0 = false;
        },
        confirm1(e) {
            this.department = e.value[0]
            this.show3 = true
            this.show2 = false;
        },
    }
}
</script>

<style scoped>
.tab_top {
    width: 100%;
    color: aquamarine;
}
</style>
